[
   {
      "id": 1,
      "country": "Ukraine",
      "dish": "Borsch",
      "kcal": "52",
      "latitude": 50.4504,
      "longitude": 30.5245,
      "link": "https://en.wikipedia.org/wiki/Borscht",
      "description": "A hearty beet soup made with vegetables, meat, and often served with sour cream. It is a staple of Ukrainian cuisine and holds cultural significance as a dish often prepared for family gatherings. The vibrant red color comes from beets, and it is usually accompanied by a slice of rye bread.",
      "videoID": "QON5m8kWf6U"
   },
   {
      "id": 2,
      "country": "France",
      "dish": "Croissant",
      "kcal": "232",
      "latitude": 48.8566,
      "longitude": 2.3514,
      "link": "https://en.wikipedia.org/wiki/Croissant",
      "description": "A buttery, flaky pastry made from layers of yeast-leavened dough and butter, shaped into a crescent. Originating from Austria but perfected in France, the croissant is a breakfast staple enjoyed worldwide. Its delicate texture comes from the lamination process, where dough is repeatedly folded and rolled out with butter. Best served fresh, often accompanied by coffee or jam, the croissant embodies the elegance of French patisserie.",
      "videoID": "djnNkLi_K6E"
   },
   {
      "id": 3,
      "country": "Italy",
      "dish": "Pizza Margherita",
      "kcal": "266",
      "latitude": 41.9028,
      "longitude": 12.4964,
      "link": "https://en.wikipedia.org/wiki/Pizza_Margherita",
      "description": "A traditional Italian pizza topped with fresh tomatoes, mozzarella, and basil. This simple yet flavorful combination represents the colors of the Italian flag. Originating from Naples, Pizza Margherita is often cooked in a wood-fired oven to achieve its signature crispy crust and smoky flavor.",
      "videoID": "az5D8C6K5Dk"
   },
   {
      "id": 4,
      "country": "Germany",
      "dish": "Currywurst",
      "kcal": "283",
      "latitude": 52.5200,
      "longitude": 13.4050,
      "link": "https://en.wikipedia.org/wiki/Currywurst",
      "description": "Currywurst is a beloved German street food that consists of a steamed, then fried pork sausage, sliced into bite-sized pieces and generously covered in a tangy tomato-based curry sauce. Often served with a side of crispy fries or a bread roll, this dish is a symbol of casual dining and post-war German culinary innovation. Its origins are traced back to Berlin in the late 1940s, where it became a quick and affordable meal for workers. Today, Currywurst stands are a common sight across Germany, and the dish remains a favorite for locals and tourists alike.",
      "videoID": "OxvCK7eUMfw"
      
   },
   {
      "id": 5,
      "country": "Spain",
      "dish": "Paella",
      "kcal": "158",
      "latitude": 40.4168,
      "longitude": -3.7038,
      "link": "https://en.wikipedia.org/wiki/Paella",
      "description": "A vibrant rice dish cooked with saffron, seafood, chicken, and vegetables. Paella originates from Valencia and is traditionally cooked in a wide, shallow pan over an open flame. The combination of flavors and the crispy layer of rice at the bottom, called socarrat, make it a beloved Spanish delicacy.",
      "videoID": "L_dDUw_QuDU"
   },
   {
      "id": 6,
      "country": "United Kingdom",
      "dish": "Fish and Chips",
      "kcal": "600",
      "latitude": 51.5074,
      "longitude": -0.1278,
      "link": "https://en.wikipedia.org/wiki/Fish_and_chips",
      "description": "Deep-fried fish served with crispy fries, often accompanied by mushy peas. This iconic British dish is traditionally wrapped in paper and eaten with a splash of malt vinegar. It became popular during the Industrial Revolution as an affordable and filling meal for the working class.",
      "videoID": "auLBC82e3Sw"
   },
   {
      "id": 7,
      "country": "Sweden",
      "dish": "Köttbullar",
      "kcal": "180",
      "latitude": 59.3293,
      "longitude": 18.0686,
      "link": "https://en.wikipedia.org/wiki/Swedish_meatballs",
      "description": "Swedish meatballs served with creamy gravy, lingonberry jam, and mashed potatoes. These small, tender meatballs are made with a mix of pork and beef, seasoned with nutmeg and allspice. The sweet-tart lingonberry sauce perfectly balances the richness of the gravy.",
      "videoID": "715fmvx0TKw"
   },
   {
      "id": 8,
      "country": "Poland",
      "dish": "Pierogi",
      "kcal": "220",
      "latitude": 52.2297,
      "longitude": 21.0122,
      "link": "https://en.wikipedia.org/wiki/Pierogi",
      "description": "Dumplings filled with potatoes, cheese, or meat, often served with sour cream. Pierogi are a versatile dish, with sweet versions filled with fruits like cherries or blueberries. They are typically boiled, but can also be pan-fried for a crispy texture.",
      "videoID": "4SJz95eyrFs"
   },
   {
      "id": 9,
      "country": "Greece",
      "dish": "Moussaka",
      "kcal": "370",
      "latitude": 37.9838,
      "longitude": 23.7275,
      "link": "https://en.wikipedia.org/wiki/Moussaka",
      "description": "A layered dish with eggplant, minced meat, and béchamel sauce, baked to perfection. This traditional Greek casserole is often seasoned with cinnamon and nutmeg, giving it a unique, warm flavor. It is a popular comfort food served during family gatherings or celebrations.",
      "videoID": "XXxJbivD3k0"
   },
   {
      "id": 10,
      "country": "Norway",
      "dish": "Rakfisk",
      "kcal": "200",
      "latitude": 59.9139,
      "longitude": 10.7522,
      "link": "https://en.wikipedia.org/wiki/Rakfisk",
      "description": "Fermented fish, typically trout, served raw with flatbread and sour cream. The fermentation process can take several months, giving Rakfisk its strong and distinctive flavor. It is often enjoyed during the winter months and paired with aquavit, a traditional Scandinavian spirit.",
      "videoID": "MtA92BpLcZs"
   },
   {
      "id": 11,
      "country": "Austria",
      "dish": "Wiener Schnitzel",
      "kcal": "320",
      "latitude": 48.2082,
      "longitude": 16.3738,
      "link": "https://en.wikipedia.org/wiki/Wiener_schnitzel",
      "description": "A classic Austrian dish consisting of a thin, breaded, and deep-fried veal cutlet. Wiener Schnitzel is traditionally served with potato salad, lingonberry jam, or a slice of lemon. Its crispy golden crust and tender meat make it a beloved comfort food across Austria and beyond.",
      "videoID": "0cqx3WWXJGs"
   },
   {
      "id": 12,
      "country": "Belgium",
      "dish": "Belgian waffles",
      "kcal": "267",
      "latitude": 50.8503,
      "longitude": 4.3517,
      "link": "https://en.wikipedia.org/wiki/Belgian_waffle",
      "description": "Thick, fluffy waffles with deep pockets, perfect for holding syrup, whipped cream, or fresh fruit. Belgian waffles are often enjoyed as a sweet breakfast or dessert and are famous for their light texture and airy structure, achieved by using yeast or whipped egg whites in the batter.",
      "videoID": "5LrfvUQDHb8"
   },
   {
      "id": 13,
      "country": "Netherlands",
      "dish": "Stroopwafel",
      "kcal": "150",
      "latitude": 52.3676,
      "longitude": 4.9041,
      "link": "https://en.wikipedia.org/wiki/Stroopwafel",
      "description": "A traditional Dutch treat made of two thin waffle cookies with a layer of caramel syrup in between. Stroopwafels are best enjoyed warm, often placed over a cup of hot coffee or tea to soften the caramel. Their rich, sweet flavor makes them a beloved snack across the Netherlands.",
      "videoID": "7oB50N96Ce4"
   },
   {
      "id": 14,
      "country": "Switzerland",
      "dish": "Fondue",
      "kcal": "400",
      "latitude": 46.9481,
      "longitude": 7.4474,
      "link": "https://en.wikipedia.org/wiki/Fondue",
      "description": "A melted cheese dish served in a communal pot, where diners dip bread into the cheese using long forks. Swiss fondue is made with a blend of cheeses like Gruyère and Emmental, white wine, and garlic. It's a social and cozy dining experience, perfect for winter gatherings.",
      "videoID": "a5yBHv0nVBg"
   },
   {
      "id": 15,
      "country": "Portugal",
      "dish": "Bacalhau à Brás",
      "kcal": "310",
      "latitude": 38.7169,
      "longitude": -9.1399,
      "link": "https://en.wikipedia.org/wiki/Bacalhau",
      "description": "A flavorful Portuguese dish made with shredded salt cod, eggs, and fried potatoes. This dish is seasoned with onions, parsley, and black olives, creating a balanced combination of textures and flavors. Bacalhau à Brás is a staple in Portuguese cuisine and a favorite among locals.",
      "videoID": "PUYFQrDnbiQ"
   },
   {
      "id": 16,
      "country": "Denmark",
      "dish": "Smørrebrød",
      "kcal": "250",
      "latitude": 55.6761,
      "longitude": 12.5683,
      "link": "https://en.wikipedia.org/wiki/Smørrebrød",
      "description": "An open-faced sandwich typically served on rye bread and topped with a variety of ingredients such as fish, meat, cheese, and pickles. Smørrebrød is a Danish culinary tradition, showcasing the simplicity and elegance of Scandinavian cuisine. Each topping combination is thoughtfully arranged for both flavor and presentation.",
      "videoID": "-Vo0i9k8oJo"
   },
   {
      "id": 17,
      "country": "Czech Republic",
      "dish": "Svíčková",
      "kcal": "230",
      "latitude": 50.0755,
      "longitude": 14.4378,
      "link": "https://en.wikipedia.org/wiki/Svíčková",
      "description": "A creamy beef dish served with a vegetable-based sauce made from carrots, parsley, and celery. It is accompanied by bread dumplings and garnished with whipped cream and cranberries. Svíčková is a Czech comfort food often enjoyed during special occasions and family gatherings.",
      "videoID": "LqbBJKnbZLw"
   },
   {
      "id": 18,
      "country": "Slovakia",
      "dish": "Bryndzové Halušky",
      "kcal": "300",
      "latitude": 48.1486,
      "longitude": 17.1077,
      "link": "https://en.wikipedia.org/wiki/Bryndzové_halušky",
      "description": "A traditional Slovak dish consisting of potato dumplings topped with creamy bryndza cheese and crispy bacon. This hearty and flavorful meal is a symbol of Slovak culinary heritage and is often served at festivals and celebrations.",
      "videoID": "xJVUg-1ClLo"
   },
   {
      "id": 19,
      "country": "Hungary",
      "dish": "Goulash",
      "kcal": "200",
      "latitude": 47.4979,
      "longitude": 19.0402,
      "link": "https://en.wikipedia.org/wiki/Goulash",
      "description": "A rich and hearty soup or stew made with beef, paprika, onions, and vegetables. Goulash is a national dish of Hungary, known for its warm, spicy flavors and nourishing qualities. It is often served with crusty bread or noodles.",
      "videoID": "JLq7CK2k_is"
   },
   {
      "id": 20,
      "country": "Finland",
      "dish": "Karjalanpiirakka",
      "kcal": "180",
      "latitude": 60.1695,
      "longitude": 24.9354,
      "link": "https://en.wikipedia.org/wiki/Karjalanpiirakka",
      "description": "A traditional Finnish pastry filled with rice porridge, wrapped in a thin rye crust. Karjalanpiirakka is commonly topped with a spread made of butter and boiled eggs. This humble yet flavorful dish originates from the Karelia region and is a staple of Finnish cuisine.",
      "videoID": "YlVYH7sVnYI"
   },
   {
      "id": 21,
      "country": "Iceland",
      "dish": "Plokkfiskur",
      "kcal": "220",
      "latitude": 64.1355,
      "longitude": -21.8954,
      "link": "https://en.wikipedia.org/wiki/Plokkfiskur",
      "description": "A comforting fish stew made with boiled cod or haddock, potatoes, and béchamel sauce. Plokkfiskur is a traditional Icelandic dish, often served with rye bread or buttered flatbread. Its creamy texture and mild flavor make it a beloved home-cooked meal.",
      "videoID": "WI_H8OvxGIc"
   },
   {
      "id": 22,
      "country": "Ireland",
      "dish": "Irish Stew",
      "kcal": "250",
      "latitude": 53.3498,
      "longitude": -6.2603,
      "link": "https://en.wikipedia.org/wiki/Irish_stew",
      "description": "A hearty stew traditionally made with lamb or mutton, potatoes, onions, and carrots. Irish Stew is a comforting dish, reflecting Ireland’s rural heritage and the simplicity of its ingredients. Often slow-cooked, it develops rich, deep flavors, making it a favorite during the cold months.",
      "videoID": "I_tevb_S7cA"
   },
   {
      "id": 23,
      "country": "Luxembourg",
      "dish": "Judd mat Gaardebounen",
      "kcal": "350",
      "latitude": 49.6117,
      "longitude": 6.1319,
      "link": "https://en.wikipedia.org/wiki/Judd_mat_Gaardebounen",
      "description": "A traditional Luxembourgish dish of smoked pork collar served with broad beans and potatoes. Judd mat Gaardebounen is a hearty meal that showcases the country’s agricultural roots. It is often enjoyed during national celebrations and reflects the rich culinary traditions of Luxembourg.",
      "videoID": "dtScPLlmpyM"
   },
   {
      "id": 24,
      "country": "Belarus",
      "dish": "Draniki",
      "kcal": "230",
      "latitude": 53.9006,
      "longitude": 27.5590,
      "link": "https://en.wikipedia.org/wiki/Draniki",
      "description": "Belarusian potato pancakes made with grated potatoes, onions, and sometimes eggs, fried until golden and crispy. Draniki are a staple in Belarusian cuisine, often served with sour cream or mushroom sauce. Their simplicity and rich flavor make them a beloved comfort food.",
      "videoID": "8snHcu2Sn0s"
   },
   {
      "id": 25,
      "country": "Moldova",
      "dish": "Mămăligă",
      "kcal": "150",
      "latitude": 47.0105,
      "longitude": 28.8638,
      "link": "https://en.wikipedia.org/wiki/Mămăligă",
      "description": "A traditional Moldovan dish made from boiled cornmeal, often served as a side dish or main course. Mămăligă is versatile and can be paired with cheese, sour cream, or stews. This humble yet nourishing dish is deeply rooted in Moldovan culture and rural life.",
      "videoID": "L0vQEBSmrgA"
   },
   {
      "id": 26,
      "country": "Romania",
      "dish": "Sarmale",
      "kcal": "200",
      "latitude": 44.4268,
      "longitude": 26.1025,
      "link": "https://en.wikipedia.org/wiki/Sarmale",
      "description": "Cabbage rolls filled with a mixture of minced meat, rice, and spices, simmered in tomato sauce. Sarmale is a staple dish in Romanian households, often prepared for festive occasions. Its rich flavor and tender texture make it a favorite comfort food across the country.",
      "videoID": "fpzw-d1YCcU"
   },
   {
      "id": 27,
      "country": "Bulgaria",
      "dish": "Banitsa",
      "kcal": "270",
      "latitude": 42.6977,
      "longitude": 23.3219,
      "link": "https://en.wikipedia.org/wiki/Banitsa",
      "description": "A traditional Bulgarian pastry made with layers of phyllo dough, filled with a mixture of eggs and cheese. Banitsa is often enjoyed as a breakfast dish or snack and is a symbol of Bulgarian hospitality. It is commonly served during holidays and celebrations, sometimes with fortune notes baked inside.",
      "videoID": "3kiBFd61n7Q"
   },
   {
      "id": 28,
      "country": "Armenia",
      "dish": "Khorovats",
      "kcal": "250",
      "latitude": 40.1792,
      "longitude": 44.4991,
      "link": "https://en.wikipedia.org/wiki/Khorovats",
      "description": "Armenian grilled meat, typically marinated and skewered before being cooked over an open flame. Khorovats is a cornerstone of Armenian cuisine and is often prepared during family gatherings and celebrations. The smoky aroma and tender meat make it a highly cherished dish.",
      "videoID": "srFPp49l20w"
   },
   {
      "id": 29,
      "country": "Georgia",
      "dish": "Khachapuri",
      "kcal": "350",
      "latitude": 41.7151,
      "longitude": 44.8271,
      "link": "https://en.wikipedia.org/wiki/Khachapuri",
      "description": "A traditional Georgian cheese-filled bread, often shaped like a boat and topped with a runny egg. Khachapuri is a comfort food that represents the warm and hospitable spirit of Georgia. Each region of the country has its own variation, making it a diverse and iconic dish.",
      "videoID": "R6idw4Rvrsk"
   }
]
